dump_app/app/controllers/clouds_controller.rb

  def fetchmsg
    @msgs = Inbox.find(:all, :conditions=> {:approved=>"true", :displayed=>"false"}, :limit=>5)
    count_msg = 0
    total_json = []
    @msgs.each{ |msg|
      msg['SenderNumber'][0]=""
      msg['SenderNumber'][1]=""
      msg['SenderNumber'][2]=""
      msg['SenderNumber'][0]="."
      msg['SenderNumber'][1]="."
      msg['SenderNumber'][2]="."
      msg['SenderNumber'][3]="."
      total_json.push({:id=>msg['ID'], :msg=>msg['TextDecoded'], :sender=>msg['SenderNumber']})
      @each_msg=Inbox.find(msg['ID'])
      @each_msg.id = msg['ID']
      @each_msg.displayed="true"
      @each_msg.save
---
SELECT * FROM `inbox` WHERE (`inbox`.`displayed` = 'false' AND `inbox`.`approved` = 'true') LIMIT 5
SELECT * FROM `inbox`
UPDATE `inbox` SET `displayed` = 'true' WHERE `id` = NULL

  def manage
    @msgs = Inbox.paginate :page=>params[:page], :conditions=> {:approved=>"false", :displayed=>"false"}
---
SELECT * FROM `inbox` WHERE (`inbox`.`displayed` = 'false' AND `inbox`.`approved` = 'false') LIMIT 0, 10

  def approve
    @msg = Inbox.find(params[:id])
    @msg.id = params[:id]
    @msg['approved']="true"
    @msg.save
---
SELECT * FROM `inbox` WHERE (`inbox`.`id` = '14')
UPDATE `inbox` SET `approved` = 'true' WHERE `id` = NULL

  def reject
    @msg = Inbox.find(params[:id])
    @msg.id = params[:id]
    @msg.destroy
---
SELECT * FROM `inbox` WHERE (`inbox`.`id` = '14')
DELETE FROM `inbox` WHERE `id` = '14'